mock-example/src/test/resources/xml/AMRLiRT/CalculateRating/rq1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:amr="http://sbrf.ru/NCP/AMRLIRT/" xmlns:cal="http://sbrf.ru/NCP/AMRLIRT/CalculateRatingRq/">
  <soap:Header/>
  <soap:Body>
    <amr:calculateRatingRq>
  <cal:arg0>
    <cal:ratingId>string</cal:ratingId>
    <cal:model>string</cal:model>
    <cal:modelIntagrationId>string</cal:modelIntagrationId>
    <!--Optional:-->
    <cal:accountId>string</cal:accountId>
    <!--Optional:-->
    <cal:uid>string</cal:uid>
    <!--Optional:-->
    <cal:account>string</cal:account>
    <!--Optional:-->
    <cal:inn>string</cal:inn>
    <!--Optional:-->
    <cal:kpp>string</cal:kpp>
    <!--Optional:-->
    <cal:gszId>string</cal:gszId>
    <!--Optional:-->
    <cal:gsz>string</cal:gsz>
    <!--Optional:-->
    <cal:subjectId>string</cal:subjectId>
    <!--Optional:-->
    <cal:subject>string</cal:subject>
    <!--Optional:-->
    <cal:subjectOKATO>string</cal:subjectOKATO>
    <!--Optional:-->
    <cal:project>string</cal:project>
    <cal:requestor>
      <cal:login>string</cal:login>
      <cal:lastName>string</cal:lastName>
      <cal:firstName>string</cal:firstName>
      <!--Optional:-->
      <cal:middleName>string</cal:middleName>
      <cal:division>string</cal:division>
      <cal:divisionCode>string</cal:divisionCode>
      <!--Optional:-->
      <cal:jobTitle>string</cal:jobTitle>
      <cal:role>string</cal:role>
    </cal:requestor>
    <cal:listOfFixedFactor>
      <!--1 or more repetitions:-->
      <cal:fixedFactor>
        <cal:factor>string</cal:factor>
        <cal:factorIntegrationId>string</cal:factorIntegrationId>
        <cal:group>string</cal:group>
        <!--Optional:-->
        <cal:value>string</cal:value>
        <!--Optional:-->
        <cal:valueIntegrationId>string</cal:valueIntegrationId>
      </cal:fixedFactor>
    </cal:listOfFixedFactor>
    <cal:listOfRatingPeriod>
      <!--1 or more repetitions:-->
      <cal:ratingPeriod>
        <!--Optional:-->
        <cal:reportDate>2008-09-29</cal:reportDate>
        <!--Optional:-->
        <cal:period>string</cal:period>
        <!--Optional:-->
        <cal:startDate>2014-09-19</cal:startDate>
        <!--Optional:-->
        <cal:endDate>2006-08-19+04:00</cal:endDate>
        <!--Optional:-->
        <cal:type>string</cal:type>
        <!--Optional:-->
        <cal:comments>string</cal:comments>
        <cal:listOfCardinalFactor>
          <!--1 or more repetitions:-->
          <cal:cardinalFactor>
            <cal:factor>string</cal:factor>
            <cal:factorIntegrationId>string</cal:factorIntegrationId>
            <cal:group>string</cal:group>
            <!--Optional:-->
            <cal:numValue>1000.00</cal:numValue>
          </cal:cardinalFactor>
        </cal:listOfCardinalFactor>
      </cal:ratingPeriod>
    </cal:listOfRatingPeriod>
    <!--Optional:-->
    <cal:listOfRatingSupport>
      <!--Zero or more repetitions:-->
      <cal:ratingSupport>
        <cal:name>string</cal:name>
        <cal:integrationId>string</cal:integrationId>
        <cal:listOfSupportFactor>
          <!--1 or more repetitions:-->
          <cal:supportFactor>
            <cal:factor>string</cal:factor>
            <cal:factorIntegrationId>string</cal:factorIntegrationId>
            <cal:group>string</cal:group>
            <!--Optional:-->
            <cal:value>string</cal:value>
            <!--Optional:-->
            <cal:valueIntegrationId>string</cal:valueIntegrationId>
            <!--Optional:-->
            <cal:freeValue>string</cal:freeValue>
          </cal:supportFactor>
        </cal:listOfSupportFactor>
      </cal:ratingSupport>
    </cal:listOfRatingSupport>
  </cal:arg0>
  <!--Optional:-->
  <cal:siebelMessage>anyType</cal:siebelMessage>
</amr:calculateRatingRq>
  </soap:Body>
</soap:Envelope>